;##############################################
;##                Пример 6                  ##
;##             "Бегущие огни"               ##
;##        с использованием таймера          ##
;##############################################

;------------------------- Псевдокоманды управления

.include "tn2313def.inc"	; Присоединение файла описаний
.list					; Включение листинга

.def	temp = r16		; Определение главного рабочего регистра
.def 	rab = r17		; Определение рабочего регистра

.equ	kdel = 780

;------------------------- Начало программного кода

.cseg 					; Выбор сегмента программного кода
.org 	0				; Устанеовка текущего адреса на ноль

;-------------------------- Инициализация стека
	
		ldi		temp, 0x7F	; Выбор адреса вершины стека 
		out		SPL, temp	; Запись его в регистр стека

;-------------------------- Инициализация Главного предделителя

		ldi		temp, 0x80  ; Записываем число $80 в регистр temp
		out		CLKPR, temp	; Записываем в регистр CLKPR
		ldi		temp, 0		; Записываем 0 в регистр temp
		out		CLKPR, temp	; Записываем этот ноль в CLKPR

;-------------------------- Инициализация портов ВВ
	
		out		DDRD, temp	; Записываем этот ноль в DDRD (порт PD на ввод)

		ldi		temp, 0xFF	; Записываем число $FF в регистр temp
		out		DDRB, temp	; Записываем это число в DDRB (порт PB на вывод)
		out		PORTB, temp	; Записываем то же число в PORTB (потушить светодиод)
		out		PORTD, temp	; Записываем его же в PORTD (вкл.внутр.резисторы)	


;-------------------------- Инициализация таймера T1

		ldi		temp, 0x05
		out		TCCR1B, temp
	
;--------------------------- Инициализация компаратора

		ldi 	temp, 0x80		; Выключение компаратора
		out		ACSR, temp

;------------------------- Начало основного цикла программы

main:	in		temp, PIND	; Считываем содержимое порта PD
		sbrs	temp, 0		; Проверка младшего разряда		
		rjmp	m3			; Если не ноль, переходим к сдвигу влево
		
;------------------------- Сдвиг вправо

m1:		ldi		rab, 0b10000000	; Запись начального значения
m2:		ldi		temp, 0xFF
		eor		temp, rab
		out		PORTB, temp		; Вывод текущего значения в порт PB
		rcall	wait1			; Задержка
		lsr		rab				; Сдвиг содержимого рабочего регистра
		brcc 	m2				; Если не дошло до конца регистра продолжить
		rjmp	main			; На начало

;------------------------- Сдвиг влево

m3:		ldi		rab, 0b00000001	; Запись начального значения
m4:		ldi		temp, 0xFF
		eor		temp, rab
		out		PORTB, temp		; Вывод текущего значения в порт PB
		rcall	wait1			; Задержка
		lsl		rab				; Сдвиг содержимого рабочего регистра
		brcc	m4				; Если не дошло до конца регистра продолжить
		rjmp	main			; На начало


;--------------------------------- Подпрограмма задержки

wait1:	push	temp			; Сохраняем содержимое регистра temp

		ldi		temp, 0			; Помещаем temp ноль
		out		TCNT1H, temp	; Записываем этот ноль в старший регистр таймера	
		out		TCNT1L, temp	; Записываем этот ноль в младший регистр таймера

wt1:	in		temp, TCNT1L	; Считываем младшую половину счетного регистра
		cpi		temp, low(kdel)	; Сравниваем с младшей частью константы
		brlo	wt1				; Переход, если temp меньше low(kd)
wt2:	in		temp, TCNT1H	; Считываем старшую половину счетного регистра
		cpi		temp, high(kdel); Сравниваем со старшей частью константы
		brlo	wt1				; Переход, если temp меньше high(kd)

		pop		temp			; Восстанавливаем значение регистра temp
		ret						; Выход из подпрограммы
