//rhodium.c - стоимость радия, вес которого равен вышему весу
#include <stdio.h>
int main (void)
{
    float weigth;   // Вес пользователя
    float value;    // Радиевый эквивалент пользователя
    printf("Хотите узнать свой радиевый эквивалент?\n");
    printf("Давай посчитаем.\n");
    printf("Пожалуйста, введите свой вес, выраженный в киллограммах: ");
    scanf("%f", &weigth);                                               //получить входные данные от пользователя
    //считаем, что цена радия равна 770 за тройскую унцию
    //14.5833 коэффициент для первода веса, выраженного в киллограмах, в тройские унции
    value = 770.0 * weigth *14.5833;
    printf("Ваш радиевый эквивалент составляет $%.5f.\n", value);
    printf("Вы легко можете стать достойным этого! Если цена радия падает,\n");
    printf("ешьте больше для поддержания своей стоимости.\n");
    return 0;
}