;##############################################
;##                                          ##
;##                Пример 11                 ##
;##              Кодовый замок               ##
;##           с музыкальным звонком          ##
;##                                          ##
;##############################################


;------------------------- Псевдокоманды управления

.include "tn2313def.inc"	; Присоединение файла описаний
.list					; Включение листинга

.def	drebL = R1		; Буфер антидребезга младший байт
.def	drebH = R2		; Буфер антидребезга старший байт
.def	temp1 = R3
.def	temp = R16		; Вспомогательный регистр
.def	data = R17		; Регистр передачи данных
.def	flz = R18		; Фаза работы замка
.def	count = R19		; Регистр передачи данных
.def	addre = R20		; Текущий адрес в EEPROM
.def	codL = R21		; Временный буфер кода младший байт
.def	codH = R22		; Временный буфер кода старший байт
.def	loop = R23		; Регистр счетчика
.def	fnota = R24		; Частота текущей ноты
.def	dnota = R25		; Длительность текущей ноты


;------------------------- Определение констант

.equ	bsize = 60		; Размер буффера для хранения кода
.equ	zad	= 3000		; Порог чувствительности
.equ	kandr = 20		; Константа антидребезга


;------------------------- Резервирование ячеек памяти (SRAM)

		.dseg			; Выбираем сегмент ОЗУ
		.org	0x60	; Устанавливаем текущий адрес сегмента

bufr:	.byte	bsize	; Буфер для приема кода
melod:	.byte	1		; Номер текущей мелодии

;------------------------- Резервирование ячеек памяти  (EEPROM)

		.eseg			; Выбираем сегмент ОЗУ
		.org	0x08	; Устанавливаем текущий адрес сегмента

klen:	.byte	1		; Резервирование ячейки для хранения длины кода
bufe:	.byte	bsize	; Буфер для хранения кода



;------------------------- Начало программного кода

		.cseg 			; Выбор сегмента программного кода
		.org	0		; Устанеовка текущего адреса на ноль

start:	rjmp	init	; Переход на начало программы
		reti			; Внешнее прерывание 0
		reti			; Внешнее прерывание 1
		reti			; Прерывание по захвату таймера T1
		rjmp	propr	; Прерывание по совпадению T1
		rjmp	propr	; Прерывание по переполнению T1
		reti			; Прерывание по переполнению T0
		reti			; Прерывание UART прием завершен
		reti			; Прерывание UART регистр данных пуст
		reti			; Прерывание UART передача завершена
		reti			; Прерывание по компаратору
		reti			; Прерывание по изменению на любом контакте
		reti			; Таймер/счетчик 1. Совпадение B 
		reti			; Таймер/счетчик 0. Совпадение B 
		reti			; Таймер/счетчик 0. Совпадение A 
		reti			; USI Стартовая готовность
		reti			; USI Переполнение
		reti			; EEPROM Готовность
		reti			; Переполнение охранного таймера


;******************************************************
;*                                                    *
;*                Модуль инициализации                *
;*                                                    *
;******************************************************
init:

;-------------------------- Инициализация стека
	
		ldi		temp, RAMEND	; Выбор адреса вершины стека 
		out		SPL, temp		; Запись его в регистр стека

;-------------------------- Инициализация портов В/В
	
		ldi		temp,0x18		; Инициализация порта PB
		out		DDRB,temp
		ldi		temp,0xE7
		out		PORTB,temp

		ldi		temp, 0x7F		; Инициализация порта PD
		out		PORTD, temp
		ldi		temp, 0
		out		DDRD, temp

;--------------------------- Инициализация (выключение) компаратора

		ldi 	temp, 0x80
		out		ACSR, temp

;--------------------------- Номер мелодии

		ldi		temp,0
		sts		melod,temp


;******************************************************
;*                                                    *
;*              Начало основной программы             *
;*                                                    *
;******************************************************
main:

;--------------------------- Инициализация таймера

		ldi		temp,high(zad)	; Записываем коэффициент задержки
		out		OCR1AH,temp
		ldi		temp,low(zad)
		out		OCR1AL,temp
		ldi		temp,0x03		; Режим работы таймера
		out		TCCR1B,temp

		ldi		codL,0x7F
		ldi		codH,0x07

m0:		rcall	incod			; Ввод и проверка кода клавиш
		brne	m0				; Если хоть одна не нажата, продолжаем 

m1:		in		temp,PINB		; Проверка кнопки звонка
		sbrs	temp,6
		rjmp	kk1				; Если нажата, переходим к звуковой части
		rcall	incod			; Вводим код
		breq	m1				; Если не одна не нажата, продолжаем 

m2:		ldi		ZH,high(bufr)	; Установка указателя
		ldi		ZL,low(bufr)	; на начало буфера
		clr		count			; Сброс счетчика байт


;---------------------- Цикл ввода кода

m3:		cli					; Запретить все прерывания
		ldi		data,1		; Вызываем задержку первого типа
		rcall	wait		; К подпрограмме задержки

m5:		rcall	incod		; Ввод и проверка кода кнопок
		st		Z+,XL		; Записываем его в буфер
		st		Z+,XH
		inc		count		; Увеличение счетчика байтов
		inc		count
		cpi		count,bsize	; Проверяем не конец ли буфера
		brsh	m7			; Если конец, завершаем ввод кода

		mov		codL,XL		; Записываем код как старый
		mov		codH,XH

		ldi		data,2		; Вызываем задержку третьего типа (подготовка к задержке)
		rcall	wait

m6:		rcall	incod		; Ввод и проверка кода кнопок
		brne	m3			; Если изменилось, записываем в буфер
		cpi		flz,1		; Проверка окончания фазы ввода кода
		brne 	m6

m7:		sbic	PINB,7		; Проверка состояния тумблера
		rjmp	m9			; К процедуре проверки кода


; ----------------------------- Режим записи кода

		mov 	data,count			; Помещаем длину кода в data
		ldi		addre,klen		; Адрес хранения длины кода
		rcall	eewr			; Записываем в длину кода EEPROM

		ldi		addre,bufe		; В регистр адреса начало буфера
		ldi		ZH,high(bufr)	; В регистровую пару Z записываем
		ldi		ZL,low(bufr)	; адрес начала буфера в ОЗУ

m8:		ld		data, Z+	; Читаем очередной байт из ОЗУ
		rcall	eewr		; Запись байта в EEPROM
		dec		count		; Декримент счетчика байтов
		brne	m8

		rjmp	m11


; ----------------------------- Процедура проверки кода
m9:
		ldi		addre,klen	; Адрес хранения длины кода 
		rcall	eerd		; Чтение длины кода из EEPROM
		cp		count,data	; Сравнение с новым значением
		brne	m13			; Если не равны, к началу

		ldi		addre,bufe		; В YL начало буфера в EEPROM
		ldi		ZH,high(bufr)	; В регистровую пару Z записываем
		ldi		ZL,low(bufr)	; адрес начала буфера в ОЗУ

m10:	rcall	eerd		; Читаем два байта из EEPROM и
		ld		temp,Z+		; Читаем два байта из ОЗУ и
		cp		data,temp	; Сравниваем два байта разных кодов
		brne 	m13			; Если не равны, переходим к началу

		dec		count		; Уменьшаем содержимое счетчика байтов
		brne	m10


; ----------------------------- Открывание замка
m11:		
		sbi		PORTB,4		; Команда "Открыть замок"
		ldi		data,3		; Вызываем задержку третьего типа
		rcall	wait
		cbi		PORTB,4		; Команда "Закрыть замок"

m13:	rjmp	main


;******************************************************
;*                                                    *
;*              Вспомогательные процедуры             *
;*                                                    *
;******************************************************

; ------------------------------ Ввод и проверка 2 байтов с клавиатуры
incod:	push	count

ic1:	ldi		count,kandr	; Константа антидребезга

ic2:	in		XL,PIND		; Вводим код (младший байт)
		andi	XL,0x7F		; Накладываем маску
		in		XH,PINB		; Вводим код (старший байт)
		andi	XH,0x07		; Накладываем маску

		cpi		count,kandr	; Это первый проход ?
		brne	ic3			; Если нет переходим к сравнению
		mov		drebL,XL	; Если да, запоминаем значение
		mov		drebH,XH
		rjmp	ic4			; Возвращаемся в начало цикла

ic3:	cp		XL,drebL	; Сверяем младший байт
		brne	ic1			; Если не равен, начинаем с начала
		cp		XH,drebH	; Сверяем старший байт
		brne	ic1			; Если не равен, начинаем с начала

ic4:	dec		count		; Уменьшаем счетчик антидребезга
		brne	ic2			; Если еще не конец, продолжаем

		cp		XL,codL		; Сравнение с временным буфером
		brne	ic5
		cp		XH,codH

ic5:	pop		count
		ret


; ------------------------------ Подпрограмма задержки
wait:
		cpi		data,1			; Проверяем код задержки
		brne	w1
		ldi		temp,0x40 		; Разрешаем прерывание по совпадению 
		rjmp	w2
w1:		ldi		temp,0x80 		; Разрешаем прерывания по переполнению

w2:		out		TIMSK,temp		; Записываем маску
		clr 	temp			; Обнуляем таймер
		out		TCNT1H,temp
		out		TCNT1L,temp

		ldi		flz,0		; Сбрасываем флаг задержки
		sei					; Разрешаем прерывания
		cpi		data,2		; Если это задержка 2-го типа
		breq	w4			; Завершаем подпрограмму

w3:		cpi		flz,1		; Ожидание окончания задержки
		brne 	w3


w4:		ret


; ------------------------------ Запись байта в ячейку EEPROM
eewr:
		sbic 	EECR,EEWE		; Проверяем готовность EEPROM
		rjmp	eewr			; Если не готов ждем
		out		EEAR,addre		; Записываем адрес в регистр адреса
		out		EEDR,data		; Записываем данные в регистр данных
		sbi		EECR,EEMWE		; Устанавливаем бит разрешения записи
		sbi		EECR,EEWE		; Устанавливаем бит записи
		inc		addre			; Увеличиваем адрес в EEPROM
		ret

; ------------------------------ Чтение байта из ячейки EEPROM
eerd:	
		sbic	EECR,EEWE		; Проверяем готовность EEPROM
		rjmp	eerd			; Если не готов ждем
		out		EEAR,addre		; Записываем адрес в регистр адреса
		sbi		EECR,EERE		; Устанавливаем бит инициализации чтения
		in		data, EEDR		; Помещаем прочитанный байт в temp
		inc		addre			; Увеличиваем адрес в EEPROM
		ret



;******************************************************
;*                                                    *
;*           Процедура обработки прерываний           *
;*                                                    *
;******************************************************

propr:	ldi		flz,1		; Установка флага задержки
		reti				; Завершаем обработку прерывания






;######################################################
;#                                                    #
;#                   Мелодичный звонок                #
;#                                                    #
;######################################################

kk1:

;--------------------------- Инициализация таймера T1

		ldi 	temp, 0x09		; Включаем режим CTC
		out		TCCR1B, temp
km1:	ldi 	temp, 0x00		; Выключаем звук
		out		TCCR1A, temp


;-------------------------- Вычисление номера нажатой кнопки

		lds		count,melod	; Читаем код текущей мелодии
		inc		count		; Увеличение номера мелодии на 1
		cpi		count,8		; Проверка не последняя ли мелодия
		brne	km2			; Если не последняя, переход
		clr		count		; Обнуление счетчика
km2:	sts		melod,count	; Помещаем номер в ячейку памяти

;-------------------------- Выбор мелодии
km3:
		mov		YL, count		; Вычисляем адрес, где
		ldi		ZL, low(tabm*2)	; хранится начало мелодии
		ldi		ZH, high(tabm*2)
		rcall	addw			; К подпрограмме 16-разрядного сложения

		lpm		XL, Z+			; Извлекаем адреса из таблицы
		lpm		XH, Z			; и помещаем в X

;--------------------------- Воспроизведение мелодии

km4:	mov		ZH, XH			; Записываем в Z начало мелодии
		mov		ZL, XL

km5:	in		temp, PINB		; Читаем содержимое порт D		
		sbrc	temp, 6			; Проверяем нажата ли еще кнопка звонка
		rjmp	km6				; Если равно (кнопки отпущены) в начало

		lpm		temp, Z			; Извлекаем код ноты
		cpi		temp, 0xFF		; Проверяем не конец ли мелодии
		breq	km4				; Если конец, начинаем мелодию сначала

		andi	temp, 0x1F		; Отделяем от кода частоту
		mov		fnota, temp		; Записываем в регистр частоту ноты
		lpm		temp, Z+		; Еще раз берем код ноты
		rol		temp			; Сдвигаем так, что бы три старших
		rol		temp			; разряда стали младшими
		rol		temp
		rol		temp
		andi	temp, 0x07		; Извлекаем код длительности задержки
		mov		dnota, temp		; Помещаеем ее в ячейку длительности

		rcall	nota			; К подпрограмме воспроизведения ноты

		rjmp	km5				; В начало цикла (следующая нота)

km6:	ldi 	temp, 0x00		; Выключаем звук
		out		TCCR1A, temp
		rjmp	main


;******************************************************
;*                                                    *
;*          Вспомогательные подпрограммы              *
;*                                                    *
;******************************************************

; ---------------------- Подпрограмма 16-ти разрядного сложения
addw:	push	YH
		
		lsl		YL				; Умножение первого слагаемого на 2
		ldi		YH, 0			; Второй байт первого слагаемого = 0
		add		ZL, YL			; Складываем два слагаемых
		adc		ZH, YH

		pop		YH
		ret

;----------------------- Подпрограмма исполнения одной ноты
nota:	push	ZH
		push	ZL
		push	YL
		push	temp

		cpi		fnota, 0x00		; Проверка не пауза ли
		breq	nt1				; Если пауза, переходим сразу к задержке

		mov		YL, fnota		; Вычисляем адрес, где хранится
		ldi		ZL, low(tabkd*2)	; коэффициент деления для текущей ноты
		ldi		ZH, high(tabkd*2)
		rcall	addw			; К подпрограмме 16-разрядного сложения

		lpm		temp, Z+		; Извлекаем мл. разр. КД для текущей ноты
		lpm		temp1, Z		; Извлекаем ст. разр. КД для текущей ноты
		out		OCR1AH, temp1	; Записать в старш. часть регистра совпадения
		out		OCR1AL, temp	; Записать в младш. часть регистра совпадения

		ldi		temp, 0x40		; Включить звук
		out		TCCR1A, temp

nt1:	rcall	wait1			; Задержка

		ldi		temp, 0x00		; Выключить звук
		out		TCCR1A, temp

		ldi		dnota,0			; Сбрасываем задержку 
		rcall	wait1			; Пауза между нотами

		pop		temp
		pop		YL
		pop		ZL
		pop 	ZH
		ret

;----------------------- Подпрограмма задержки
wait1:	push	ZH
		push	ZL
		push	YH
		push	YL

		mov		YL, dnota		; Вычисляем адрес, где хранится
		ldi		ZL, low(tabz*2)	; нужный коэффициент задержки
		ldi		ZH, high(tabz*2)
		rcall	addw			; К подпрограмме 16-разрядного сложения

		lpm		YL, Z+			; Читаем первый байт коэффициента задержки
		lpm		YH, Z			; Читаем второй байт коэффициента задержки

		clr		ZL				; Обнуляем регистровую пару Z
		clr		ZH

		; Цикл задержки
ww1:	ldi		loop,255		; Пустой внутренний цикл
ww2:	dec		loop
		brne 	ww2
		adiw	R30, 1			; Увеличиваем регистр Z на единицу
		cp		YL, ZL			; Проверка младшего разряда
		brne	ww1
		cp		YH, ZH			; Проверка старшего разряда
		brne	ww1

		pop		YL				; Завершение подпрограммы
		pop		YH
		pop		ZL
		pop 	ZH
		ret




;******************************************************
;*                                                    *
;*                Таблица задержек                    *
;*                                                    *
;******************************************************

tabz:   .dw      128,256,512,1024,2048,4096,8192


;******************************************************
;*                                                    *
;*          Таблица коэффициентов деления             *
;*                                                    *
;******************************************************

tabkd:	.dw		0
		.dw		4748,4480,4228,3992,3768,3556,3356,3168,2990,2822,2664,2514
		.dw		2374,2240,2114,1996,1884,1778,1678,1584,1495,1411,1332,1257
		.dw		1187,1120,1057, 998, 942, 889, 839, 792


;******************************************************
;*                                                    *
;*            Таблица начал всех мелодий              *
;*                                                    *
;******************************************************

tabm:	.dw		mel1*2,mel2*2,mel3*2,mel4*2
		.dw		mel5*2,mel6*2,mel7*2,mel8*2


;******************************************************
;*                                                    *
;*                   Таблица мелодий                  *
;*                                                    *
;******************************************************

;        В траве сидел кузнечик
mel1:	.db		109,104,109,104,109,108,108, 96,108,104 
		.db		108,104,108,109,109, 96,109,104,109,104 
		.db		109,108,108, 96,108,104,108,104,108,141 
		.db		 96,109,111, 79, 79,111,111,112, 80, 80 
		.db		112,112,112,111,109,108,109,109, 96,109 
		.db		111, 79, 79,111,111,112, 80, 80,112,112 
		.db		112,111,109,108,141,128, 96,255 

;        Песенка крокодила Гены
mel2:	.db		109,110,141,102,104,105,102,109,110,141 
		.db		104,105,107,104,109,110,141,104,105,139 
		.db		109,110,173, 96,114,115,146,109,110,112 
		.db		109,114,115,146,107,109,110,114,112,110 
		.db		146,109,105,136,107,105,134,128,128,102 
		.db		105,137,136,128,104,107,139,137,128,105 
		.db		109,141,139,128,110,109,176,112,108,109 
		.db		112,144,142,128,107,110,142,141,128,105 
		.db		109,139,128,173,134,128,128,109,112,144 
		.db		142,128,107,110,142,141,128,105,109,139 
		.db		128,173,146,128, 96,255

;        В лесу родилась елочка
mel3:	.db		132,141,141,139,141,137,132,132,132,141 
		.db		141,142,139,176,128,144,146,146,154,154 
		.db		153,151,149,144,153,153,151,153,181,128 
		.db		 96,255

;        Happy births to you
mel4:	.db		107,107,141,139,144,143,128,107,107,141
		.db		139,146,144,128,107,107,151,148,146,112
		.db		111,149,117,117,148,144,146,144,128,255

;       С чего начинается родина
mel5:	.db		 99,175,109,107,106,102, 99,144,111,175 
		.db		 96, 99,107,107,107,107,102,104,170, 96 
		.db		 99,109,109,109,109,107,106,143,109,141 
		.db		 99,109,109,109,109,104,106,171, 96, 99 
		.db		111,109,107,106,102, 99,144,111,143,104 
		.db		114,114,114,114,109,111,176, 96,104,116 
		.db		112,109,107,106, 64, 73,143,107,131, 99 
		.db		144, 80, 80,112,111, 64, 75,173,128,255

;        Из кинофильма "Веселые ребята"
mel6:	.db		105,109,112,149,116, 64, 80,148,114, 64 
		.db		 78,146,112, 96,105,105,109,144,111, 64 
		.db		 80,145,112, 64, 81,178, 96,117,117,117 
		.db		149,116, 64, 82,146,112, 64, 79,146,144 
		.db		 96,105,105,107,141,108,109,112,110,102 
		.db		104,137,128, 96,105,105,105,137,102, 64 
		.db		 73,142,105,107,109, 64, 75,137, 96,105 
		.db		105,105,137,102,105,142,112, 64, 82,180 
		.db		 96,116,116,116,148,114,112,142,109, 64 
		.db		 78,146,144, 96,105,105,107,141,108,109 
		.db		112,110,102,104,169, 96, 96,255

;        Улыбка
mel7:	.db		107,104,141,139,102,105,104,102,164,128 
		.db		104,107,109,109,109,111,114,112,111,109 
		.db		144,139,128,109,111,144, 96,111,109,104 
		.db		107,105,173,128,111,109,112,107,111,109 
		.db		109,107,102,104,134,132,128,100,103,107
		.db		107,107,107,139,112,100,103,102,102,102 
		.db		134,102,103,107,105,107,108,108,108,108 
		.db		107,105,107,108,144,142,128,112,107,110 
		.db		140,112,105,108,107,107,107,105,140,139 
		.db		139,112,103,102,103,105,108,107,105,103 
		.db		128,112,107,110,108,108,108,140,112,105 
		.db		108,107,107,107,139,112,103,102,103,105 
		.db		108,107,105,103,105,139,132,128, 96, 96 
		.db		 96,255

;        Огонек
mel8:	.db		102,105,141,107,105,141, 96,107,171, 96 
		.db		104,105,139,104,105,166,128,160,109,110 
		.db		144,110,109,144, 96,110,174,128,110,112 
		.db		146,112,114,205,117,117,149,116,114,149
		.db		 96,116,174,128,110,112,146,112,114,205 
		.db		128,102,105,141,107,105,141, 96,107,171 
		.db		128,104,105,139,104,105,166,128,128,117 
		.db		117,149,116,114,149, 96,116,174,128,110
		.db		112,146,112,114,205,128,102,105,141,107 
		.db		105,141, 96,107,171,128,104,105,139,104
		.db		105,166,128,128, 96,255 




