/*****************************************************
Project : Prog7
Comments: "Бегущие огни" с использованием прерывания по таймеру
*****************************************************/

#include <avr/io.h>
#include <avr/iotn2313.h>
#include <avr/interrupt.h>


// Описание глобальной переменной
unsigned char rab;

//Процедура обработки прерывания по Таймеру 1
ISR (TIMER1_COMPA_vect)
{
   if (bit_is_set(PIND,0))  // Проверка состояния переключателя
     { 
     rab = rab >> 1;  // Сдвиг разрядов
     if (rab==0) rab = 0b10000000;  // Сдвиг вправо
     }  
   else
     { 
     rab = rab << 1;  // Сдвиг разрядов
     if (rab==0) rab = 0b00000001;  // Сдвиг влево
     }  
     PORTB=rab^0xFF;  // Запись в порт с инверсией
}



// Основная процедура программы
int main(void)
{
// Описание локальной переменной
unsigned char rab;

// Коэффициент предварительногр делителя системного генератора
CLKPR=0x80;
CLKPR=0x00;    // Равен 1 (без деления)

// Порты ввода/вывода
PORTA=0x00;  // Порт A
DDRA=0x00;

PORTB=0xFF;  // Порт B
DDRB=0xFF;

PORTD=0x7F;  // Порт C
DDRD=0x00;

// Таймер 1
TCCR0A=0x00;
TCCR0B=0x00;
TCNT0=0x00;
OCR0A=0x00;
OCR0B=0x00;

// Таймер 2
TCCR1A=0x00;
TCCR1B=0x0D;
TCNT1H=0x00;
TCNT1L=0x00;
ICR1H=0x00;
ICR1L=0x00;
//OCR1AH=0x03;
//OCR1AL=0x0C;
OCR1A=780;
OCR1BH=0x00;
OCR1BL=0x00;

// Внешние прерывания
GIMSK=0x00;
MCUCR=0x00;

// Маска прерываний по таймерам
TIMSK=0x40;

// Универсальный последовательный интерфейс
USICR=0x00;

// Аналоговый компаратор
ACSR=0x80;

rab=0b00010000;  // Присвоение начального значения
sei();           // Разрешение прерываний

while (1) {};    // Бесконечный цикл
}
