;##############################################
;##                                          ##
;##                Пример 10                 ##
;##              Кодовый замок               ##
;##                                          ##
;##############################################


;------------------------- Псевдокоманды управления

.include "tn2313def.inc"	; Присоединение файла описаний
.list					; Включение листинга

.def	drebL = R1		; Буфер антидребезга младший байт
.def	drebH = R2		; Буфер антидребезга старший байт
.def	temp = R16		; Вспомогательный регистр
.def	data = R17		; Регистр передачи данных
.def	flz = R18		; Флаг задержки
.def	count = R19		; Регистр передачи данных
.def	addre = R20		; Текущий адрес в EEPROM
.def	codL = R21		; Временный буфер кода младший байт
.def	codH = R22		; Временный буфер кода старший байт

;------------------------- Определение констант

.equ	bsize = 60		; Размер буфера для хранения кода
.equ	kzad  = 3000	; Задержка сканирования
.equ	kandr = 20		; Константа антидребезга


;------------------------- Резервирование ячеек памяти (SRAM)

		.dseg			; Выбираем сегмент ОЗУ
		.org	0x60	; Устанавливаем текущий адрес сегмента

bufr:	.byte	bsize	; Буфер для приема кода


;------------------------- Резервирование ячеек памяти  (EEPROM)

		.eseg			; Выбираем сегмент EEPROM
		.org	0x08	; Устанавливаем текущий адрес сегмента

klen:	.byte	1		; Резервирование ячейки для хранения длины кода
bufe:	.byte	bsize	; Буфер для хранения кода



;------------------------- Начало программного кода

		.cseg 			; Выбор сегмента программного кода
		.org	0		; Установка текущего адреса на ноль

start:	rjmp	init	; Переход на начало программы
		reti			; Внешнее прерывание 0
		reti			; Внешнее прерывание 1
		reti			; Таймер/счетчик 1, захват
		rjmp	propr	; Таймер/счетчик 1, совпадение, канал A
		rjmp	propr	; Прерывание по переполнению T1
		reti			; Прерывание по переполнению T0
		reti			; Прерывание UART прием завершен
		reti			; Прерывание UART регистр данных пуст
		reti			; Прерывание UART передача завершена
		reti			; Прерывание по компаратору
		reti			; Прерывание по изменению на любом контакте
		reti			; Таймер/счетчик 1. Совпадение, канал B 
		reti			; Таймер/счетчик 0. Совпадение, канал B 
		reti			; Таймер/счетчик 0. Совпадение, канал A 
		reti			; USI Стартовая готовность
		reti			; USI Переполнение
		reti			; EEPROM Готовность
		reti			; Переполнение охранного таймера


;******************************************************
;*                                                    *
;*                Модуль инициализации                *
;*                                                    *
;******************************************************
init:

;-------------------------- Инициализация стека
	
		ldi		temp, RAMEND	; Выбор адреса вершины стека 
		out		SPL, temp		; Запись его в регистр стека

;-------------------------- Инициализация портов В/В
	
		ldi		temp,0x18		; Инициализация порта PB
		out		DDRB,temp
		ldi		temp,0xE7
		out		PORTB,temp

		ldi		temp, 0x7F		; Инициализация порта PD
		out		PORTD, temp
		ldi		temp, 0
		out		DDRD, temp

;--------------------------- Инициализация (выключение) компаратора

		ldi 	temp, 0x80
		out		ACSR, temp

;--------------------------- Инициализация таймера

		ldi		temp,high(kzad)	; Записываем коэффициент задержки
		out		OCR1AH,temp
		ldi		temp,low(kzad)
		out		OCR1AL,temp
		ldi		temp,0x03		; Режим работы таймера
		out		TCCR1B,temp



;******************************************************
;*                                                    *
;*              Начало основной программы             *
;*                                                    *
;******************************************************
main:
		ldi		codL,0x7F		; Код для сравнения (мл. байт)
		ldi		codH,0x07		; Код для сравнения (ст. байт)

m0:		rcall	incod			; Ввод и проверка кода клавиш
		brne	m0				; Если хоть одна не нажата, продолжаем 

m1:		rcall	incod			; Вводим код
		breq	m1				; Если не одна не нажата, продолжаем 

m2:		ldi		ZH,high(bufr)	; Установка указателя
		ldi		ZL,low(bufr)	; на начало буфера
		clr		count			; Сброс счетчика байт

;---------------------- Цикл ввода кода

m3:		cli					; Запретить все прерывания
		ldi		data,1		; Вызываем задержку первого типа
		rcall	wait		; К подпрограмме задержки

m5:		rcall	incod		; Ввод и проверка кода кнопок
		st		Z+,XL		; Записываем его в буфер
		st		Z+,XH
		inc		count		; Увеличение счетчика байтов
		inc		count
		cpi		count,bsize	; Проверяем не конец ли буфера
		brsh	m7			; Если конец, завершаем ввод кода

		mov		codL,XL		; Записываем код как старый
		mov		codH,XH

		ldi		data,2		; Вызываем задержку третьего типа (подготовка к задержке)
		rcall	wait

m6:		rcall	incod		; Ввод и проверка кода кнопок
		brne	m3			; Если изменилось, записываем в буфер
		cpi		flz,1		; Проверка окончания фазы ввода кода
		brne 	m6

m7:		sbic	PINB,7		; Проверка состояния тумблера
		rjmp	m9			; К процедуре проверки кода

; ----------------------------- Режим записи кода

		mov 	data,count		; Помещаем длину кода в data
		ldi		addre,klen		; Адрес хранения длины кода
		rcall	eewr			; Записываем в длину кода EEPROM

		ldi		addre,bufe		; В регистр адреса начало буфера в EEPROM
		ldi		ZH,high(bufr)	; В регистровую пару Z записываем
		ldi		ZL,low(bufr)	; адрес начала буфера в ОЗУ

m8:		ld		data, Z+	; Читаем очередной байт из ОЗУ
		rcall	eewr		; Запись байта в EEPROM
		dec		count		; Декремент счетчика байтов
		brne	m8			; Если не конец, продолжаем запись			

		rjmp	m11			; К процедуре открывания замка		


; ----------------------------- Режим проверки кода
m9:
		ldi		addre,klen	; Адрес хранения длины кода 
		rcall	eerd		; Чтение длины кода из EEPROM
		cp		count,data	; Сравнение с новым значением
		brne	m13			; Если не равны, к началу

		ldi		addre,bufe		; В YL начало буфера в EEPROM
		ldi		ZH,high(bufr)	; В регистровую пару Z записываем
		ldi		ZL,low(bufr)	; адрес начала буфера в ОЗУ

m10:	rcall	eerd		; Читаем очередной байт из EEPROM 
		ld		temp,Z+		; Читаем очередной байт из ОЗУ 

		cp		data,temp	; Сравниваем два байта разных кодов
		brne 	m13			; Если не равны, переходим к началу

		dec		count		; Уменьшаем содержимое счетчика байтов
		brne	m10			; Если не конец, продолжаем проверку


; ----------------------------- Открывание замка
m11:		
		sbi		PORTB,4		; Команда "Открыть замок"
		ldi		data,3		; Вызываем задержку третьего типа
		rcall	wait
		cbi		PORTB,4		; Команда "Закрыть замок"

m13:	rjmp	main


;******************************************************
;*                                                    *
;*              Вспомогательные процедуры             *
;*                                                    *
;******************************************************

; ------------------------------ Ввод и проверка 2 байтов с клавиатуры
incod:	push	count

		ldi		XL,0		; Обнуление регистровой пары X
		ldi		XH,0

ic1:	ldi		count,kandr	; Константа антидребезга
		mov		drebL,XL	; Старое значение младший байт
		mov		drebH,XH	; Старое значение старший байт

ic2:	in		XL,PIND		; Вводим код (младший байт)
		cbr		XL,0x80		; Накладываем маску
		in		XH,PINB		; Вводим код (старший байт)
		cbr		XH,0xF8		; Накладываем маску

ic3:	cp		XL,drebL	; Сверяем младший байт
		brne	ic1			; Если не равен, начинаем с начала
		cp		XH,drebH	; Сверяем старший байт
		brne	ic1			; Если не равен, начинаем с начала

ic4:	dec		count		; Уменьшаем счетчик антидребезга
		brne	ic2			; Если еще не конец, продолжаем

		cp		XL,codL		; Сравнение с временным буфером
		brne	ic5
		cp		XH,codH

ic5:	pop		count
		ret


; ------------------------------ Подпрограмма задержки
wait:
		cpi		data,1			; Проверяем код задержки
		brne	w1
		ldi		temp,0x40 		; Разрешаем прерывание по совпадению 
		rjmp	w2
w1:		ldi		temp,0x80 		; Разрешаем прерывания по переполнению

w2:		out		TIMSK,temp		; Записываем маску
		clr 	temp			; Обнуляем таймер
		out		TCNT1H,temp
		out		TCNT1L,temp

		ldi		flz,0		; Сбрасываем флаг задержки
		sei					; Разрешаем прерывания
		cpi		data,2		; Если это задержка 2-го типа
		breq	w4			; Завершаем подпрограмму

w3:		cpi		flz,1		; Ожидание окончания задержки
		brne 	w3

		cli					; Запрещаем прерывания

w4:		ret


; ------------------------------ Запись байта в ячейку EEPROM
eewr:
		cli						; Запрещаем прерывания
		sbic 	EECR,EEWE		; Проверяем готовность EEPROM
		rjmp	eewr			; Если не готов ждем
		out		EEAR,addre		; Записываем адрес в регистр адреса
		out		EEDR,data		; Записываем данные в регистр данных
		sbi		EECR,EEMWE		; Устанавливаем бит разрешения записи
		sbi		EECR,EEWE		; Устанавливаем бит записи
		inc		addre			; Увеличиваем адрес в EEPROM
		ret

; ------------------------------ Чтение байта из ячейки EEPROM
eerd:	
		cli						; Запрещаем прерывания
		sbic	EECR,EEWE		; Проверяем готовность EEPROM
		rjmp	eerd			; Если не готов ждем
		out		EEAR,addre		; Записываем адрес в регистр адреса
		sbi		EECR,EERE		; Устанавливаем бит инициализации чтения
		in		data, EEDR		; Помещаем прочитанный байт в data
		inc		addre			; Увеличиваем адрес в EEPROM
		ret



;******************************************************
;*                                                    *
;*           Процедура обработки прерываний           *
;*                                                    *
;******************************************************

propr:	ldi		flz,1		; Установка флага задержки
		reti				; Завершаем обработку прерывания




