;##############################################
;##                Пример 8                  ##
;##    Сигнальное устройство "Семь нот"      ##
;##                                          ##
;##############################################

;------------------------- Псевдокоманды управления

.include "tn2313def.inc"	; Присоединение файла описаний
.list					; Включение листинга

.def	temp = r16		; Определение главного рабочего регистра
.def	count = r17		; Определение регистра-счетчика


;------------------------- Начало программного кода

		.cseg 			; Выбор сегмента программного кода
		.org	0		; Устанеовка текущего адреса на ноль

start:	rjmp	init	; Переход на начало программы
		reti			; Внешнее прерывание 0
		reti			; Внешнее прерывание 1
		reti			; Прерывание по захвату таймера T1
		reti			; Прерывание по совпадению T1
		reti			; Прерывание по переполнению T1
		reti			; Прерывание по переполнению T0
		reti			; Прерывание UART прием завершен
		reti			; Прерывание UART регистр данных пуст
		reti			; Прерывание UART передача завершена
		reti			; Прерывание по компаратору
		reti			; Прерывание по изменению на любом контакте
		reti			; Таймер/счетчик 1. Совпадение B 
		reti			; Таймер/счетчик 0. Совпадение B 
		reti			; Таймер/счетчик 0. Совпадение A 
		reti			; USI Стартовая готовность
		reti			; USI Переполнение
		reti			; EEPROM Готовность
		reti			; Переполнение охранного таймера


; ------------------- Модуль инициализации
init:

;-------------------------- Инициализация стека
	
		ldi		temp, RAMEND	; Выбор адреса вершины стека 
		out		SPL, temp		; Запись его в регистр стека

;-------------------------- Инициализация портов В/В
	
		ldi 	temp, 0x08		; Инициализация порта PB
		out		DDRB, temp

		ldi		temp, 0x00
		out		DDRD, temp		; Инициализация порта PD
		out		PORTB, temp		; Выходное значение порта PB

		ldi 	temp, 0x7F
		out		PORTD, temp		; Включение внутренних резисторов

;--------------------------- Инициализация (выключение) компаратора

		ldi 	temp, 0x80
		out		ACSR, temp


;--------------------------- Инициализация таймера T1

		ldi 	temp, 0x09		; Включаем режим CTC
		out		TCCR1B, temp
m1:		ldi 	temp, 0x00		; Выключаем звук
		out		TCCR1A, temp


;-------------------------- Начало основной программы
main:
		clr 	count		; Обнуление счетчика опроса клавиш
		in		temp, PIND	; Чтение порта D		
m2:		lsr 	temp		; Сдвигаем входной байт
		brcc 	m3			; Если текущий разряд был равен 0
		inc		count		; Увеличиваем показание счетчика
		cpi		count, 7	; Сравнение (7 - конец сканирования)
		brne	m2			; Если не конец, продолжить
		rjmp	m1			; Если не одна клавиша не нажата

m3:		lsl		count				; Умножение номера кнопки на 2
		mov		YL, count			; Создаем первое слагаемое
		ldi		YH, 0				; Старший его байт равен нулю
		ldi		ZL, low(tabkd*2)	; Второе слаеаемое - начало таблицы tabkd
		ldi		ZH, high(tabkd*2)
		add		ZL, YL				; Складываем два 16-разр. слагаемых
		adc		ZH, YH

		lpm		YL, Z+			; Читаем младший байт коэфф. деления
		lpm		YH, Z			; Читаем младший байт коэфф. деления
		out		OCR1AH, YH		; Записать младш. байт коэфф.деления
		out		OCR1AL, YL		; Записать старш. байт коэфф.деления

		ldi		temp, 0x40		; Включить звук
		out		TCCR1A, temp
		rjmp	main




; ###########################################################
; ##            Таблица коэффициентов деления              ##
; ###########################################################

tabkd:	.dw		4748,4480,4228,3992,3768,3556,3356







