;##############################################
;##                Пример 3                  ##
;##     Программа переключения светодиода    ##
;##       с использованием антидребезга      ##   
;##############################################

;------------------------- Псевдокоманды управления

.include "tn2313def.inc"	; Присоединение файла описаний
.list						; Включение листинга

;------------------------- Начало программного кода

.cseg 				; Выбор сегмента программного кода
.org	0			; Устанеовка текущего адреса на ноль

.def	temp = r16	; Определение главного рабочего регистра
.def	loop = r17	; Определение регистра организации цикла


;-------------------------- Инициализация стека
	
		ldi		temp, 0x7F	; Выбор адреса вершины стека 
		out		SPL, temp	; Запись его в регистр стека

;-------------------------- Инициализация Главного предделителя

		ldi		temp, 0x80  ; Записываем число $80 в регистр temp
		out		CLKPR, temp	; Записываем в регистр CLKPR
		ldi		temp, 0		; Записываем 0 в регистр temp
		out		CLKPR, temp	; Записываем этот ноль в CLKPR

;-------------------------- Инициализация портов ВВ
	
		out		DDRD, temp	; Записываем этот ноль в DDRD (порт PD на ввод)

		ldi		temp, 0xFF	; Записываем число $FF в регистр temp
		out		DDRB, temp	; Записываем это число в DDRB (порт PB на вывод)
		out		PORTB, temp	; Записываем то же число в PORTB (потушить светодиод)
		out		PORTD, temp	; Записываем его же в PORTD (включаем внутр. резисторы)

;--------------------------- Инициализация компаратора

		ldi 	temp, 0x80		; Выключение компаратора
		out		ACSR, temp

;-------------------------- Начало основного цикла
main:
		in		temp, PIND	; Читаем содержимое порта PD
		sbrc	temp, 0		; Проверка младшего разряда
		rjmp	main		; Если не ноль, переходим в начало
		rcall	wait		; Вызов подпрограммы задержки

;-------------------------------- Переключение светодиода

		in		temp, PINB	; Читаем содержимое порта PB
		sbrc	temp, 0		; Проверка младшего разряда
		rjmp	m1
		sbi		PORTB, 0	; Установка выход PB0 в единицу
		rjmp	m2
m1:		cbi		PORTB, 0	; Сброс PB0 в ноль

;-------------------------------- Цикл ожидания отпускания кнопки
m2:		in		temp, PIND	; Читаем содержимое порта PD
		sbrs	temp, 0		; Проверка младшего разряда
		rjmp	m2			; Продолжить ожидание отпускания кнопки

		rcall	wait		; Вызов подпрограммы задержки
		rjmp	main		; К началу цикла


;--------------------------------- Подпрограмма задержки

wait:	push	loop		; Сохраняем содержимое регистра loop
		ldi		loop, 200	; Помещаем в loop константу задержки
							; Цикл задержки
wt1:	dec		loop		; Уменьшаем значение регистра loop
		brne	wt1			; Если не ноль, продолжаем цикл

		pop		loop		; Восстанавливаем значение регистра loop
		ret					; Выход из подпрограммы
