/*****************************************************
This program was produced by the
CodeWizardAVR V1.24.4 Standard
Automatic Program Generator
© Copyright 1998-2004 Pavel Haiduc, HP InfoTech s.r.l.
http://www.hpinfotech.com
e-mail:office@hpinfotech.com

Project : Пример 11
Version : 1
Date    : 07.03.2006
Author  : Belov                           
Company : Home                            
Comments: 
Кодовый замок с музыкальным дверным звонком


Chip type           : ATtiny2313
Clock frequency     : 4,000000 MHz
Memory model        : Tiny
External SRAM size  : 0
Data Stack size     : 32
*****************************************************/

#include <tiny2313.h>
#include <delay.h>

#define klfree 0x77F  // Код состояния при полностью отпущеных кнопках
#define zad 3000      // Код задержки при сканировании
#define kandr 20      // Константа антидребезга
#define bsize 30      // Размер буфера для хранения кода

unsigned char flz;   // Флаг задержки
unsigned int bufr[bsize];   // Буфер в ОЗУ для хранения кода
unsigned char melod;  // Текущий номер мелодии

//#pragma warn-
eeprom unsigned char klen = 0xFF;          // Ячейка для хранения длины кода
eeprom unsigned int bufe[bsize]={0xFF};   // Буфер в EEPROM для хранения кода
//#pragma warn+

// Таблица задержек
flash unsigned int tabz[] =  {32,64,128,256,512,1024,2048};

// Таблица коэффициентов деления
flash unsigned int tabkd[] = {0,4748,4480,4228,3992,3768,3556,3356,3168,2990,2822,
        2664,2514,2374,2240,2114,1996,1884,1778,1678,1584,1495,1411,1332,1257,
        1187,1120,1057, 998,942,889,839,792};
// Таблицы мелодий
// В траве сидел кузнечик
flash unsigned char mel1[] = {109,104,109,104,109,108,108,96,108,104,108,104,108,
        109,109,96,109,104,109,104,109,108,108,96,108,104,108,104,108,141,96,109,
        111, 79, 79,111,111,112,80,80,112,112,112,111,109,108,109,109, 96,109,111,
        79,79,111,111,112,80,80,112,112,112,111,109,108,141,128,96,255};
// Песенка крокодила Гены
flash unsigned char mel2[] = {109,110,141,102,104,105,102,109,110,141,104,105,107, 
        104,109,110,141,104,105,139,109,110,173,96,114,115,146,109,110,112,109, 
        114,115,146,107,109,110,114,112,110,146,109,105,136,107,105,134,128,128,102,
        105,137,136,128,104,107,139,137,128,105,109,141,139,128,110,109,176,112,108,
        109,112,144,142,128,107,110,142,141,128,105,109,139,128,173,134,128,128,109,
       112,144,142,128,107,110,142,141,128,105,109,139,128,173,146,128,255};  
// В лесу родилась елочка
flash unsigned char mel3[] = {132,141,141,139,141,137,132,132,132,141,141,142,139,
        176,128,144,146,146,154,154,153,151,149,144,153,153,151,153,181,128,96,255};
// Happy births day to you
flash unsigned char mel4[] = {107,107,141,139,144,143,128,107,107,141,139,146,144,
        128,107,107,151,148,146,112,111,149,117,117,148,144,146,144,128,255};
// С чего начинается родина
flash unsigned char mel5[] = {99,175,109,107,106,102,99,144,111,175,96,99,107,107,
        107,107,102,104,170,96,99,109,109,109,109,107,106,143,109,141,99,109,109,109,
        109,104,106,171,96,99,111,109,107,106,102,99,144,111,143,104,114,114,114,114,
        109,111,176, 96,104,116,112,109,107,106,64,73,143,107,131,99,144,80,80,112,
        111,64,75,173,128,255};
// Из кинофильма "Веселые ребята"
flash unsigned char mel6[] = {105,109,112,149,116,64,80,148,114,64,78,146,112,96,105,
        105,109,144,111,64,80,145,112,64,81,178,96,117,117,117,149,116,64,82,146,112,
        64,79,146,144,96,105,105,107,141,108,109,112,110,102,104,137,128,96,105,105,
        105,137,102,64,73,142,105,107,109,64,75,137,96,105,105,105,137,102,105,142,112,
        64,82,180,96,116,116,116,148,114,112,142,109,64,78,146,144,96,105,105,107,141,
        108,109,112,110,102,104,169,96,96,255};
// Улыбка
flash unsigned char mel7[] = {107,104,141,139,102,105,104,102,164,128,104,107,109,109,
        109,111,114,112,111,109,144,139,128,109,111,144, 96,111,109,104,107,105,173,128,
        111,109,112,107,111,109,109,107,102,104,134,132,128,100,103,107,107,107,107,139,
        112,100,103,102,102,102,134,102,103,107,105,107,108,108,108,108,107,105,107,108,
        144,142,128,112,107,110,140,112,105,108,107,107,107,105,140,139,139,112,103,102,
        103,105,108,107,105,103,128,112,107,110,108,108,108,140,112,105,108,107,107,107,
        139,112,103,102,103,105,108,107,105,103,105,139,132,128,96,96,96,255};		 
// Огонек
flash unsigned char mel8[] = {102,105,141,107,105,141, 96,107,171,96,104,105,139,104,105,
        166,128,160,109,110,144,110,109,144,96,110,174,128,110,112,146,112,114,205,117,
        117,149,116,114,149,96,116,174,128,110,112,146,112,114,205,128,102,105,141,107,
        105,141,96,107,171,128,104,105,139,104,105,166,128,128,117,117,149,116,114,149,
        96,116,174,128,110,112,146,112,114,205,128,102,105,141,107,105,141,96,107,171,
        128,104,105,139,104,105,166,128,128,96,255};

// Таблица начал всех мелодий
flash unsigned char *tabm[] = {mel1, mel2, mel3, mel4, mel5, mel6, mel7, mel8};





// Прерывание по переполнению Таймера 1
interrupt [TIM1_OVF] void timer1_ovf_isr(void)
{
   flz=1;
}

// Прерывание по совпадению в канале A Таймера 1
interrupt [TIM1_COMPA] void timer1_compa_isr(void)
{
   flz=1;
}

// Функция опроса клавиатуры и антидребезга
unsigned int incod (void)
{
   unsigned int cod0=0;
   unsigned int cod1;
   unsigned char k;
   
   for (k=0; k<kandr; k++)
     {
       cod1=PINB&0x7;
       cod1=(cod1<<8)+(PIND&0x7F);
       if (cod0!=cod1) 
       {
          k=0;
          cod0=cod1;
       }
     }
   return cod1;
}


// Процедура формирования задержки
void wait (unsigned char kodz)
{
   if (kodz==1) TIMSK=0x40;     // Выбор маски прерываний по таймеру
   else TIMSK=0x80;
   TCNT1=0;                    // Обнуление таймера
   flz=0;                      // Сброс флага задержки
   #asm("sei");                // Разрешаем прерывания
   if (kodz!=2) while(flz==0); // Цикл задержки
}

// Музыкальная программа
void muz (void)
{
      unsigned char fnota;    // Код тона ноты
      unsigned char dnota;    // Код длительности ноты
      flash unsigned char *nota;  // Ссылка на текущую ноту
      
      TCCR1B=0x09;                  // Программирование таймера
      // Воспроизведение мелодии
m3:   nota = tabm[melod];           // Устанавливаем указатель на первую ноту
m4:   if (PINB.6!=0) goto m2;       // Если ни одна кнопка не нажата, закончить
      if (*nota==0xFF) goto m3;     // Проверка на конец мелодии
      fnota = (*nota)&0x1F;         // Определяем код тона
      dnota = ((*nota)>>5)&0x07;    // Определяем код длительности
      if (fnota==0) goto m5;        // Если пауза не воспроизводим звук
      OCR1A=tabkd[fnota];           // Программируем частоту звука
      TCCR1A=0x40;                  // Включаем звук
m5:   delay_ms (tabz[dnota]);       // Формируем задержку
      TCCR1A=0x00;                  // Выключаем звук
      delay_ms (tabz[0]);           // Задержка между нотами
      nota++;                       // Перемещаем указатель на следующую ноту
      goto m4;                      // К началу цикла
m2:   TCCR1A=0x00;                  // Выключаем звук
      if (++melod>=8) melod=0;       // Увеличиваем счетчик мелодий
}


// Основная функция
void main(void)
{
unsigned char ii;  // Указатель массива
unsigned char i;   // Вспомогательный указатель
unsigned int codS; // Старый код

PORTB=0xE7;  // Порт B
DDRB=0x18;
PORTD=0x7F;  // Порт D
DDRD=0x00;
TCCR1A=0x00;  // Таймер/Счетчик 1
TCNT1=0;
OCR1A=zad;
ACSR=0x80;    // Аналоговый компаратор
melod=0;      // Сбрасываем счетчик мелодий

while (1)
      {
m1:     while (incod() != klfree); // Ожидание отпускания кнопок
        while (incod() == klfree)  // Ожидание нажатия кнопок
           if (PINB.6==0) muz();   // К музыкальному звонку
        TCCR1B=0x03;               // Настройка таймера
        ii=0;                      // Сброс счетчика байтов
m2:     #asm("cli");               // Запрещаем прерывания
        wait(1);                   // Задержка 1-го типа
        codS=incod();              // Ввод кода и запись, как старого
        bufr[ii++]=codS;           // Запись очередного кода в буфер
        if (ii>=bsize) goto m4;    // Проверка конца буфера
        
        wait(2);                        // Задержка 2-го типа
m3:     if (incod() != codS) goto m2;   // Проверка не изменилось ли состояние
        if (flz==0) goto m3;         // Проверка окончания контрольного промежутка времени
        
m4:     if (PINB.7==1) goto comp;       // Проверка переключателя режимов

//------------------------------ Запись кода в EEPROM
        klen=ii;                                // Запись длины кода
        for (i=0; i<ii; i++)  bufe[i]=bufr[i];  // Запись всех байтов кода
        goto zamok;

//------------------------------ Проверка кода
comp:   if (klen!=ii) goto m1;              // Проверка длины кода
        for (i=0; i<ii; i++)  if (bufe[i]!=bufr[i]) goto m1;  // Проверка самого кода


//------------------------------ Открывание замка
zamok:  PORTB.4=1;        // Открываем замок
        wait(3);          // Задержка 3-го типа
        PORTB.4=0;        // Закрываем замок
      };
}
