;##############################################
;##               Пример 1                   ##
;##     Программа управления светодиодом     ##
;##############################################

;------------------------- Псевдокоманды управления

.include "2313def.inc"	; Присоединение файла описаний
.list					; Включение листинга

;------------------------- Начало программного кода

.cseg 				; Выбор сегмента программного кода
.org 0				; Устанеовка текущего адреса на ноль
.def	temp = r16	; Определение главного рабочего регистра


;-------------------------- Инициализация стека
	
		ldi		temp, 0x7F	; Выбор адреса вершины стека 
		out		SPL, temp	; Запись его в регистр стека

;-------------------------- Инициализация портов ВВ
	
		ldi		temp, 0		; Записываем число 0 в регистр temp
		out		DDRD, temp	; Записываем этот ноль в DDRD (порт PD на ввод)

		ldi		temp, 0xFF	; Записываем число $FF в регистр temp
		out		DDRB, temp	; Записываем это число в DDRB (порт PB на вывод)
		out		PORTB, temp	; Записываем то же число в PORTB (потушить светодиод)
		out		PORTD, temp	; Записываем его же в PORTD (включаем внутр. резисторы)

;--------------------------- Инициализация компаратора

		ldi 	temp, 0x80		; Выключение компаратора
		out		ACSR, temp

;-------------------------- Основной цикл
main:
		in		temp, PORTD	; Читаем содержимое порта PD
		out		PORTB, temp	; Пересылаем в порт PB
		rjmp	main		; К началу цикла
